Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem.SelectByProfileName Method
 Selects the parametric profile item in the profile database using the given name.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SelectByProfileName(
	string ProfileName
)
Public Function SelectByProfileName (
	ProfileName As String
) As Boolean
Parameters
ProfileName
Type: System.String
The profile name to be select
Return Value
Type: Boolean
True on success.
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace